package com.liucanwen.citylist.data;

import com.liucanwen.citylist.model.CityItem;
import com.liucanwen.citylist.widget.ContactItemInterface;
import com.liucanwen.citylist.widget.pinyin.PinYin;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.util.ArrayList;
import java.util.List;

/**
 * 357个中国城市
 * @author ck
 * @since 2014年2月7日 16:20:32
 */
public class CityData
{

/*北京','上海','石家庄','昆明','杭州','广州','成都','西安','南京','深圳','重庆','长沙','沈阳','','厦门','武汉','海口','乌鲁木齐','青岛','大连',' 三亚','哈尔滨','长春','南宁','贵阳','福州','郑州','济南','桂林','天津','太原','南昌','\n" +
			"	 */
	static String cityJson = "{'cities':['#全国','上海','北京','杭州','广州','南京','苏州','深圳','成都','重庆','天津','宁波','扬州','无锡','福州','厦门','武汉','西安','沈阳'," +
		"'大连','青岛','济南','海口','石家庄','唐山','秦皇岛','邯郸','邢台','保定','张家口','承德','沧州','廊坊','衡水','太原','大同','阳泉','长治','晋城','朔州','晋中','运城'," +
		"'忻州','临汾','吕梁','呼和浩特','包头','乌海','赤峰','通辽','鄂尔多斯','呼伦贝尔','兴安盟','锡林郭勒','乌兰察布','巴彦淖尔','阿拉善','鞍山','抚顺','本溪','丹东','锦州'," +
		"'营口','阜新','辽阳','盘锦','铁岭','朝阳','葫芦岛','长春','吉林','四平','辽源','通化','白山','松原','白城','延边','哈尔滨','齐齐哈尔','鸡西','鹤岗','双鸭山','大庆','伊春'" +
		",'佳木斯','七台河','牡丹江','黑河','绥化','大兴安岭','徐州','常州','南通','连云港','淮安','盐城','镇江','泰州','宿迁','温州','嘉兴','湖州','绍兴','金华','衢州','舟山','台州'" +
		",'丽水','合肥','芜湖','蚌埠','淮南','马鞍山','淮北','铜陵','安庆','黄山','滁州','阜阳','宿州','六安','亳州','池州','宣城','莆田','三明','泉州','漳州','南平','龙岩','宁德'," +
		"'南昌','景德镇','萍乡','九江','新余','鹰潭','赣州','吉安','宜春','抚州','上饶','淄博','枣庄','东营','烟台','潍坊','济宁','泰安','威海','日照','莱芜','临沂','德州','聊城'," +
		"'滨州','菏泽','郑州','开封','洛阳','平顶山','安阳','鹤壁','新乡','焦作','濮阳','许昌','漯河','三门峡','南阳','商丘','信阳','周口','驻马店','黄石','十堰','宜昌','襄阳','" +
		"鄂州','荆门','孝感','荆州','黄冈','咸宁','随州','恩施州','仙桃','潜江','天门','株洲','湘潭','衡阳','邵阳','岳阳','常德','张家界','益阳','郴州','永州','怀化','娄底','湘西'," +
		"'韶关','珠海','汕头','佛山','江门','湛江','茂名','肇庆','惠州','梅州','汕尾','河源','阳江','清远','东莞','中山','潮州','揭阳','云浮','南宁','柳州','桂林','梧州','北海','" +
		"防城港','钦州','贵港','玉林','百色','贺州','河池','自贡','攀枝花','泸州','德阳','绵阳','广元','遂宁','内江','乐山','南充','眉山','宜宾','广安','达州','雅安','巴中','资阳'," +
		"'阿坝','甘孜州','凉山','贵阳','六盘水','遵义','安顺','铜仁地区','黔西南','毕节地区','黔东南','黔南','昆明','曲靖','玉溪','保山','昭通','楚雄州','红河','文山州','普洱'," +
		"'西双版纳','大理州','德宏','丽江','怒江','迪庆','临沧','拉萨','昌都地区','山南','日喀则地区','那曲','阿里','林芝地区','铜川','宝鸡','咸阳','渭南','延安','汉中','榆林','" +
		"安康','商洛','兰州','嘉峪关','金昌','白银','天水','武威','张掖','平凉','酒泉','庆阳','定西','陇南','临夏州','甘南','西宁','海东','海北','黄南','果洛','玉树','海西','银川'," +
		"'石嘴山','吴忠','固原','乌鲁木齐','克拉玛依','吐鲁番地区','哈密地区','昌吉州','博尔塔拉','巴音郭楞','阿克苏地区','克孜勒苏','喀什地区','和田地区','伊犁','塔城地区','阿勒泰地区'" +
		",'石河子','香港','澳门','长沙','三亚','中卫','儋州','保亭','昌江','澄迈县','崇左','定安县','东方','济源','来宾','乐东','陵水','琼海','神农架林区','图木舒克','屯昌县','万宁','" +
		"文昌','海南州']}";
	/*static String cityJson = "{'cities':['#好','#dd','鞍山市','安庆市','安阳市','阿坝藏族羌族自治州','安顺市','安康市','阿里地区','阿勒泰地区','阿克苏地区','阿拉尔市','阿拉善盟','澳门特别行政区','\n" +
			"\t 北京市','保定市','本溪市','白城市','白山市','蚌埠市','亳州市','滨州市','白银市','\n" +
			"\t 巴中市','毕节地区','白沙黎族自治县','保亭黎族苗族自治县','保山市','宝鸡市','百色市','北海市','博尔塔拉蒙古自治州','巴音郭楞蒙古自治州','包头市','巴彦淖尔市','\n" +
			"\t 长沙市','承德市','沧州市','朝阳市','常州市','滁州市','巢湖市','池州市','郴州市','常德市','潮州市','成都市','澄迈县','昌江黎族自治县','楚雄彝族自治州','崇左市\n" +
			"\t ','昌都地区','昌吉回族自治州','赤峰市','大同市','大连市','丹东市','大兴安岭地区','大庆市','德州市','东营市','东莞市','定西市','\n" +
			"\t 达州市','德阳市','儋州市','东方市','定安县','德宏傣族景颇族自治州','大理白族自治州','迪庆藏族自治州','恩施市','鄂州市','鄂尔多斯市','\n" +
			"\t 抚顺市','阜新市','阜阳市','福州市','抚州市','佛山市','防城港市','赣州市','广州市','甘南藏族自治州','广安市','甘孜藏族自治州','广元市','贵阳市','\n" +
			"\t 衡水市','呼和浩特市','呼伦贝尔市','和田地区','哈密地区','河池市','贺州市','汉中市','海西蒙古族藏族自治州','邯郸市','海南藏族自治州','黄南藏族自治州','海东地区','\n" +
			"\t 海北藏族自治州','红河哈尼族彝族自治州','海口市','河源市','惠州市','怀化市','衡阳市','黄石市','黄冈市','鹤壁市','菏泽市','黄山市','淮北市','淮南市','合肥市','\n" +
			"\t 湖州市','杭州市','淮安市','黑河市','鹤岗市','哈尔滨市','葫芦岛市','嘉义市','基隆市','酒泉市','嘉峪关市','金昌市','江门市','揭阳市','荆门市','荆州市','\n" +
			"\t 焦作市','济源市','济宁市','济南市','景德镇市','吉安市','九江市','金华市','嘉兴市','佳木斯市','鸡西市','吉林市','锦州市','晋城市','晋中市','\n" +
			"\t 开封市','昆明市','克孜勒苏柯尔克孜自治州','克拉玛依市','喀什地区','林芝地区','拉萨市','柳州市','来宾市','丽江市','临沧市','陵水黎族自治县','乐东黎族自治县','\n" +
			"\t 临高县','六盘水市','凉山彝族自治州','乐山市','泸州市','临夏回族自治州','陇南市','兰州市','娄底市','漯河市','洛阳市','聊城市','莱芜市','临沂市','龙岩市','\n" +
			"\t 六安市','丽水市','连云港市','辽源市','辽阳市','吕梁市','临汾市','廊坊市','牡丹江市','马鞍山市','茂名市','梅州市','绵阳市','眉山市','\n" +
			"\t 南京市','南通市','宁波市','宁德市','南平市','南昌市','南阳市','南充市','内江市','怒江傈傈族自治州','南宁市','那曲地区','\n" +
			"\t 盘锦市','莆田市','萍乡市','平顶山市','濮阳市','平凉市','攀枝花市','普洱市','秦皇岛市','齐齐哈尔市','七台河市','衢州市','泉州市','青岛市','潜江市','清远市','\n" +
			"\t 庆阳市','黔南布依族苗族自治州','黔东南苗族侗族自治州','黔西南布依族苗族自治州','琼海市','琼中黎族苗族自治县','曲靖市','钦州市','日照市','日喀则地区','上海市','石家庄市','朔州市','沈阳市','四平市','松原市','双鸭山市','绥化市','苏州市\",\n" +
			"\t \"宿迁市','绍兴市','宿州市','厦门市','三明市','上饶市','商丘市','三门峡市','神农架林区','十堰市','随州市','邵阳市','汕尾市','韶关市','汕头市','深圳市','\n" +
			"\t 遂宁市','三亚市','商洛市','山南地区','石嘴山市','石河子市','天津市','唐山市','太原市','铁岭市','通化市','泰州市','台州市','铜陵市','泰安市','\n" +
			"\t 天门市','天水市','铜仁地区','屯昌县','铜川市','塔城地区','吐鲁番地区\"','图木舒克市','通辽市','台北市','台中市','台南市','\n" +
			"\t 无锡市','温州市','芜湖市','潍坊市','威海市','武汉市','武威市','五指山市','文昌市','万宁市','文山壮族苗族自治州','渭南市','梧州市','吴忠市','乌鲁木齐市','五家渠市','\n" +
			"\t 乌海市','乌兰察布市','邢台市','忻州市','徐州市','宣城市','新余市','新乡市','许昌市','信阳市','襄阳市','\n" +
			"\t 孝感市','咸宁市','仙桃市','湘潭市','湘西土家族苗族自治州','西双版纳傣族自治州','西宁市','西安市','咸阳市','锡林郭勒盟','兴安盟','新竹市','香港特别行政区','\n" +
			"\t 阳泉市','运城市','营口市','延边朝鲜族自治州','伊春市','扬州市','盐城市','鹰潭市','宜春市','烟台市','宜昌市','岳阳市','益阳市','永州市','阳江市','云浮市','\n" +
			"\t 宜宾市','雅安市','玉溪市','玉树藏族自治州','延安市','榆林市','玉林市','银川市','伊犁哈萨克自治州\"','\n" +
			"\t 重庆市','张家口市','长治市','长春市','镇江市','舟山市','漳州市','淄博市','枣庄市','郑州市','周口市','驻马店市','株洲市','张家界市','珠海市','肇庆市','湛江市','\n" +
			"\t 中山市','张掖市','自贡市','资阳市','遵义市','昭通市','中卫市']}";*/

	public static List<ContactItemInterface> getSampleContactList()
	{
		List<ContactItemInterface> list = new ArrayList<ContactItemInterface>();

		try
		{
			JSONObject jo1 = new JSONObject(cityJson);

			JSONArray ja1 = jo1.getJSONArray("cities");

			for(int i = 0; i < ja1.length(); i++)
			{
				String cityName = ja1.getString(i);

				list.add(new CityItem(cityName, PinYin.getPinYin(cityName)));
			}
		}
		catch (JSONException e)
		{
			e.printStackTrace();
		}

		return list;
	}

}
