package com.nevermore.muzhitui.module.json;

import java.util.List;

/**
 * Created by Administrator on 2017/2/28.
 */

public class QuickReplyBean {
    /**
     * [
     {
     "category": "一）拇指推常见问题汇总",
     "list": [
     {
     "name": "1、如何购买拇指推会员",
     "url": "如果是用拇指推微信公共号端购买， 请进入拇指推公共号， 点击“进拇指推”，点击“我”，点击“我的账户”，选择购买， 在购买的弹框里，
     有年费会员和终身会员两种， 目前拇指的价格是年费298/年， 终身会员是894/终身， 下面的卡密栏目如果没有可以不用输入， 直接点击购买即可！
     如果你是用拇指推的APP购买， 那么你可以直接点击“我的账户”，选择“购买会员”即可，注意：在购买的时候无法输入上级推荐人ID，因为这是系统默认的。 "
     },
     {
     "name": "2、拇指推的使用方法基本操作",
     "url": "首先在你的朋友圈找一个你认为好的文章， 打开文章， 点击右上角的三个点点， 找到“复制链接”，然后将复制后的链接粘贴到拇指推主页面“文章编辑”框， 然后点击拇指秒变， 然后， 你可以轻轻点击屏幕任意位置就可以随意对文章进行编辑了， 你还可以编辑你的名片， 以后再编辑文章， 你的名片就会自动进入文章中， 非常方便好用， 一篇好的文章 ， 阅读量都在4千~1万多， 所以试试吧，
     如果还是不懂， 你可以直接点击下面的链接观看新手教程：
     http://www.muzhitui.cn/song/wx/base.html "
     },
     {
     "name": "3、拇指推如何设置名片",
     "url": "如果您用的是APP，请点击“我的作品”版块，点击上面的头像可以设置名片；如果您用的拇指推公众号端的应用， 请点击我“我”，点击上面的头像设置名片，具体的如何设置名片，您可以点击下面的链接观看新手教程：
     http://www.muzhitui.cn/song/wx/card.html "
     },
     {
     "name": "4、拇指推如何创建广告模板",
     "url": "如果您用的是APP，请点击工具栏里的模板（路径选项：点击“我的作品”点击“模板”）就可以创建了，同时模板可以设置动画效果。
     如果您用的拇指推公众号应用，那么点击“我”点击“模板”就可以设置了。
     如果还是不懂， 你可以直接点击下面的链接观看新手教程：
     http://www.muzhitui.cn/song/wx/admode.html "
     },
     {
     "name": "5、拇指推正确的推广方法",
     "url": "推广方式是这样的： 你可以关注拇指推的公共号， 然后在点击“app下载”，里面有菜单栏，选择“推广赚钱”， 只要把这个页面截屏下来发给你的好友， 或者分享到朋友圈，你的好友通过扫描你的个人专属二维码扫描成为拇指推会员， 那么他就是你的下一级用户， 推广会员返利制度：一级30%，二级15%，三级10%的收益， 或者在APP里，点击“我的账户”，进入“推广中心”或者点击下面的二维码，将这个页面截屏或者直接分享给你的好友， 他通过你分享的进入后， 也是你的一级用户， 很简单， 可以试试
     注意：一定要确保您推荐的用户是扫描您的拇指推二维码才能绑定上下级关系，切记不可先下载APP或者直接通过搜索公众号的方式关注拇指推，这样是无法绑定关系的。
     "
     },
     {
     "name": "6、为什么一定要关注拇指推“公众号”",
     "url": "拇指推平台有两个操作前端，一个是拇指推APP，一个是拇指推公众号，无论是公众号还是APP，两个前端的后台账号是都同步统一的，无论您在公众号里购买会员还是APP里购买会员， 账户都是一样的，同时最重要的一点为什么要关注公众号是因为拇指推公众号会给您推送收益消息，比如谁关注了您成为您的几级用户， 谁购买了会员，您获得了多少钱，都是通过公众号推送的，因此，建议用户一定要关注“拇指推公众号”，并保持置顶状态。"
     },
     {
     "name": "7、为什么我有很多下级用户，但是买单的用户非常少",
     "url": "这是因为虽然你推广了拇指推的推广码，对方也扫描了拇指推进入拇指推平台， 但是最大的问题是这些用户并不知道拇指推的功能， 所以， 当你推广的用户扫描成为关注用户后， 你要教学他拇指推是做什么的， 和介绍拇指推的强大功能， 这样你的关注用户将会很容易购买会员成为拇指推的付费用户。当一个用户成为您的下级用户后， 您可以通过我的下级联系他，教会他如何使用拇指推，如此可以增加用户的转化率"
     },
     {
     "name": "8、为什么会出现网络异常的情况",
     "url": "如果您长时间不登录拇指推平台， 这个时候， 由于拇指推后台一直会更新功能，所以会导致您的前端操作跟后台无法进行信息通信导致出现“网络异常”
     ，正确的解决办法是点击“设置”“退出登录”从新进入一下就解决了。
     "
     },
     {
     "name": "9、为什么购买了会员有时候还会显示“非会员状态”",
     "url": "因为您的手机有系统的缓存，只要您退出拇指推，从新登陆一下就可以解决了，或者退出当前页面，从新进入当前页面就可以显示年费会员或者终身会员了。"
     }
     ]
     },
     {
     "category": "二）关于文章编辑",
     "list": [
     {
     "name": "1、复制粘贴链接，点击拇指秒变时，提示不支持此链接",
     "url": "因为有些公众号文章可能有引用加密保护权限，以及部分文章存在适配问题，导致该文章无法引用。请尝试换一个链接。"
     },
     {
     "name": "2、为什么文章粘贴不了？",
     "url": "进入拇指推—文章编辑后，长按链接粘贴处，弹出“粘贴”按钮，点击，就能将链接粘贴过来。如果你的手机无法复制或者无法黏贴， 请退出微信或者重启开机尝试，因为这一般是你的手机系统的问题"
     },
     {
     "name": "3、如何插入视频？",
     "url": "注意：如果要在文章中植入视频，首先你这个视频必须是一个视频网站的视频，将这个视频网站的视频链接复制下来通过广告模板的方式在文章中植入视频，目前不支持在文章中植入本地视频插。"
     },
     {
     "name": "4、为什么点击文字没有反应？",
     "url": "部分手机型号存在这个问题。由于手机型号众多，技术上逐一适配需要时间，请此部分用户提供处问题的手机型号，便于程序哥哥进行适配。 "
     },
     {
     "name": "5、为什么每篇文章都是显示一个大拇指的照片？",
     "url": "修改完文章后，第一次点击“完成”按钮，弹出修改文章标题和缩略图界面，点击左侧的缩略图位置，从手机相册中选择合适的缩略图，并做适当剪切，保存后即可替换原文章的缩略图。"
     },
     {
     "name": "6、如何删除已经插入的广告链接",
     "url": "一篇文章，当你插入了自己带有链接的广告，下次继续编辑的时候，这些广告链接是继续有效的，因此，你点击的时候就会跳转到你的广告页面。你可以选择在我的作品或者草稿中删除这篇文章，重新编辑，或者去我的模板中删除掉相关广告的链接，然后打开文章删除你插入的广告。"
     },
     {
     "name": "7、关于音乐的问题",
     "url": "有些用户在插入音乐后说没有声音，因为苹果公司对文章的音乐链接或者自动播放的链接做了限制，为了防止恶意消耗用户的流量，所以苹果手机音乐是需要点击音乐按钮才能播放。
     如果植入音乐后，将无法删除音乐，只有一个办法是重新编辑文章，那么在你重新编辑文章前， 请进入的我的作品里，把你刚刚编辑的文章删除重新编辑才有效，不然还是会出现之前编辑的状态。
     "
     },
     {
     "name": "8、文章下面的拇指推的广告能去掉吗？",
     "url": "用户会发现每次编辑完文章后， 文章的底部都会有拇指推的广告，目前拇指推编辑文章底部会出现关于拇指推平台的广告，这个位置其实是用户自己的推广码，因为这个位置点击进入后，会出现使用户自己的推广码，如果读者扫描了这个推广码会成为你的下级，这个位置等于是拇指推和用户公用的广告区域。是下级用户的入口。"
     },
     {
     "name": "9、能否去掉文章中拇指推的广告",
     "url": "首先，无论是文章顶部还是文章底部的广告，都是用户自己的下级用户入口，因为无论读者从上面的“通栏广告”进入拇指推平台还是从下面的广告位置通过扫描您的二维码进入拇指推平台，都会成为您的下级用户，这个时候，如果他购买了拇指推会员，您是有30%收益的"
     },
     {
     "name": "10、如何删除我编辑过的文章	6",
     "url": "如果您用的拇指推APP，请进入“我的作品”，向左滑动文章作品，就可以出现删除按钮；
     如果您用的拇指推公众号端，可以进入“我”，就可以看到删除文章按钮了。"
     }
     ]
     },
     {
     "category": "三）关于名片设置",
     "list": [
     {
     "name": "1、如何设置名片",
     "url": "如果您用的是APP，请点击“我的作品”版块，点击上面的头像可以设置名片；如果您用的拇指推公众号端的应用， 请点击我“我”，点击上面的头像设置名片，具体的如何设置名片，您可以点击下面的链接观看新手教程：
     http://www.muzhitui.cn/song/wx/card.html"
     },
     {
     "name": "2、为什么我编辑完成名片后，没有显示名片",
     "url": "系统默认的是每篇文章都显示名片，但是如果你不想在文章中显示名片，那么在你编辑完文章第一次点击“完成”的时候， 会出现显示名片和不显示名片的开关， 你可以选择显示和不显示"
     },
     {
     "name": "3、如何不显示我的手机号码在名片中",
     "url": "可能是编辑名片后没有确认提交，或者你的介绍中有非法字符，比如特殊的符号等。"
     },
     {
     "name": "4、如何更改我的拇指推头像和更改推广码的头像",
     "url": "你可以点击“我”， 点击头像重新设置名片，在设置名片的页面中， 手机号码的后面有显示/不显示手机号码的开关， 你可以选择关闭和隐藏。"
     }
     ]
     },
     {
     "category": "四）关于推广赚钱",
     "list": [
     {
     "name": "1、为什么我推荐的朋友不在我的会员里面？",
     "url": "拇指推设置了个人专属推广码，如果你的客户扫描了你的个人推广码进入拇指推公众号，你和他就绑定了上下级关系，你就成为他的上级。如果是客户自行搜索公众号进入或者先下载了拇指推APP后登陆了拇指推平台，你们之间就没有发生绑定关系。如果确认客户是你的客户，只是客户在不知情的情况下搜索公众号进入，可以提交相关的证明请求拇指推平台客服进行客户变更。
     拇指推客服微信号：muzhituikefu"
     },
     {
     "name": "2、推广码是怎么回事？",
     "url": "推广码是您个人专属的二维码，你注册了拇指推公众号，就会自动生成一个独一无二的，专属于你个人的推广码。用户通过扫描您的推广码，可以完成绑定你们上下级的关系，同时又进入了公众号。"
     },
     {
     "name": "3、拇指推专属推广码和公众号二维码什么区别",
     "url": "公众号二维码只能进入公众号，推广码除了跟公众号二维码一样，可以扫码进入公众号外，还是一个带有个人参数的二维码，可以绑定个人和扫码者的关系。扫码者扫码完成后，即实现两个功能：1、进入公众号，2、绑定上下级关系。"
     },
     {
     "name": "4、我的专属拇指推推广码在哪里？",
     "url": "路径一：进入拇指推公众号，点击“进拇指推”，点击“推广码”，就是带有您头像的个人推广码页面。
     路径二：进入拇指推APP，点击“我的帐户”，点击“推广中心”，
     注意：好的推广方法是将推广码页面截屏下来分享到朋友圈、微信群或者直接发给您的好友。"
     },
     {
     "name": "5、购买会员付款完成后，说是付款失败？",
     "url": "购买会员，付款完成后，马上点击返回，就会返回到付款之前的页面，提示说是付款失败。这是因为你尚未等到页面跳转就点击了返回导致的。这种情况并不影响到款项的执行，你可以到我的帐户中查看你的会员是否购买成功。或者推出拇指推，重新进入（刷新），就可以看到你的会员购买成功了。"
     },
     {
     "name": "6、如何提现？",
     "url": "拇指推规定满100元可以提现，
     如果您用的是拇指推公共号，提现的方法是进入“我”-“我的帐户”，点击提现，输入您的微信号和手机，就可以进行提现了。
     如果您用的拇指推APP，请点击“我的账户”，按照要求点击提现即可。
     一般来说，提现后24小时内后台系统会审核，提现金额会直接支付到您的“微信钱包”
     "
     },
     {
     "name": "7、如何查看我的提现记录？",
     "url": "进入“我”-“我的帐户”-“提现”，点击下方查看提现记录。"
     },
     {
     "name": "8、关于提现和到账",
     "url": "拇指推用户可以通过点击“我”，点击“我的账户”进行购买和提现， 如果是普通会员， 提现一般在24小时内都会准时到账，到账会直接进入你的微信钱包，同时微信会给你相应的到账通知， 如果是代理商提现， 大金额可能会在1~2工作日到账，周六日或者节假日不支持到账，但是仍然可以正常提现，只是节假日，系统后台不进行提现审核和放款。"
     },
     {
     "name": "9、如何查看我的下级用户",
     "url": "如果您用的拇指推APP，请点击“人脉”，点击“我的下级”就可以及时跟您的下级用户沟通交流了，教会她如何使用拇指推"
     },
     {
     "name": "10、如何查看自己的会员编号（ID）？",
     "url": "如果您用的拇指推APP，请点击“我的账户”，头像下面有用户ID；
     如果您用的拇指推公众号，请点击“进拇指推”，点击“推广码”就可以查看ID号了"
     }
     ]
     },
     {
     "category": "五）其他问题",
     "list": [
     {
     "name": "1、非会员无法分享？",
     "url": "如果您还没有购买拇指推的年费会员或者终身会员，那么，您有5次免费试用的机会，如果5次机会用完了，您觉得拇指推平台很好，可以购买会员，同时非会员如果试用拇指推的APP是无法分享文章的，需要购买会员才能分享文章。"
     },
     {
     "name": "2、为什么我的文章还没有转发出去就有阅读量？",
     "url": "文章一旦编辑好，就会出现在素材库，很多会员会进入素材库查看好文章，引用转发好文章。你的阅读量就会产生。"
     },
     {
     "name": "3、为什么你的文章阅读数增长速度这么快？",
     "url": "阅读数来源1：你的文章在分享到朋友圈后，被点击的次数多，来源2，朋友进行了分享，点击量累计到了这篇文章，来源3，素材库中有会员进行了阅读分享。因此阅读数会增长很快。"
     },
     {
     "name": "4、在发布文章时如何快捷添加我的二维码？",
     "url": "如果您在相册中去找你的二维码，还是不太方便，拇指推提供了一种简便的方法，打开模板，选择“页尾模板”，将你需要插入的二维码保存好，以后每次要插入二维码的时候，只需要随时调用就行了。"
     },
     {
     "name": "5、拇指推平台设置了“敏感词汇”过滤功能",
     "url": "因为拇指推词库里有敏感词汇， 如果涉及到敏感的词汇， 文章是编辑不了的， 就会直接弹出敏感词汇提示
     敏感词汇包括但不限于：云联惠；全返；共产党；共党；死全家；云支付；云返；云联；薄熙来；虚拟货币；数字货币；比特币；网络货币；雷达币；虚拟电子货币；数字加密货币DGC；DGC；加密币；维卡币；博彩；赛马会；激情表演；激情一幕；激情场面；激情现场；法轮功；WorldVentures；直销课堂；裸聊；DIGIT；数字币；匀加速等；"
     },
     {
     "name": "6、为什么我的下级有购买会员， 但是我的返利却看不到",
     "url": "比如我下级用户有购买会员， 但是我查看我的收益列表没有这个会员的返利，这是因为你下面的这个会员上级是拇指推的代理商， 如果这个会员是通过扫描代理商的二维码购买了拇指推的会员， 那么他的支付全额会到代理商的账户， 通过代理商购买上级无返利， 不做上级的三级返利， 所以， 你没有得到收益。"
     },
     {
     "name": "7、为什么我推荐的用户购买了会员， 我没有收益",
     "url": "这是因为，第一， 他不在你的下面， 因为拇指推系统客户关系锁定是用户第一次关注拇指推平台的时候就锁定了客户关系， 以后无论这个用户取消重新关注， 还是重新扫描任何的推广码， 这个关系都不会改变。
     第二、你的推广方法不正确，您推荐的用户没有扫描您的拇指推推广码，所以没有绑定关系，拇指推的关系绑定是非常稳定的，只要方法正确，是不会出现推广无法绑定的情况，除非你的错误的推广方式导致关系绑定失败"
     },
     {
     "name": "8、会员上下级关系调整的声明",
     "url": "如果您推荐的用户由于推广方法错误导致推广的用户没有在自己的下面，那么，您可以联系公司的客服进行申请调整关系，但是请注意一下几点：
     第一、如果推广的会员已经有上级的情况下，为了保证公平公正的前提下是不能申请调整会员关系的；
     第二、如果没有上级，由于操作错误导致推广会员直接成为系统下面的会员，那么在没有购买会员前可以提出申请调整关系，同时需要提供微信聊天截图证明是您推荐的，如果推荐的会员已经购买了会员， 那么在提供相应的证据证明是自己的推广的前提下，关系可以调整，但是返现金额无法调整，因为系统财务系统无法对返现进行操作。
     如果需要联系拇指推客服，请联系客服微信号：muzhituikefu"
     },
     {
     "name": "9、如果我不是拇指推会员推广有收益吗？",
     "url": "如果没有购买拇指推的会员， 去推广拇指推，仍然享受三级返利，但是提现无法通过后台审核，提现无效，所以一定要成为拇指推的会员才可以提现。"
     },
     {
     "name": "10、如何成为拇指推的代理商",
     "url": "可以通过联系拇指推的客服或者直接跟拇指推公司联系，或者通过点击“我”，点击“我的账户”，选择“我的代理”申请代理商，我们的客服会在24小时内跟你联系。"
     },
     {
     "name": "11、成为代理商的五大收益制度",
     "url": "代理商分为:
     A级24000（300个号，每个号80元）
     B级20000（200个号，每个号100元）
     C级12000（100个号，每个号120元）
     代理商收益制度
     1、直推用户，会员费全部归您
     如果您是代理商，那么您的直接推广的一级用户如果购买会员， 那么无论是年费（298）或者终身会员（894）将全额进入到您的账户！

     2、您将有推广费的10%的业绩提成
     如果您是代理商，您下面所发生的所有的用户，不分级别，您都将获得10%的会员费提成，这就等于您可以什么都不用做，可以坐收10%的返利提成；

     3、只有代理商可以推荐代理商
     如果您是代理商，那么如果你推荐好友做代理商， 您可以享受25%的代理费返利提成（只有代理商才享受此政策）"
     }
     ]
     }
     ]
     */

    private String category;
    private List<ListBean> list;

    public String getCategory() {
        return category;
    }

    public void setCategory(String category) {
        this.category = category;
    }

    public List<ListBean> getList() {
        return list;
    }

    public void setList(List<ListBean> list) {
        this.list = list;
    }

    public static class ListBean {
        /**
         * name : 无背景音乐
         * url :
         */

        private String name;
        private String url;

        boolean isCheck=false;
        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }
        public boolean isCheck() {
            return isCheck;
        }

        public void setCheck(boolean check) {
            isCheck = check;
        }


    }

}
